Revit 2027 API
CutMarkSymbol Enumeration
 The available shapes for the cut mark symbol.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CutMarkSymbol
Public Enumeration CutMarkSymbol
public enum class CutMarkSymbol
type CutMarkSymbol
Members
Member name | Value | Description
Curve | 2 |  Cut mark shape is curved.
None | 0 |  Cut mark shape is linear.
Zigzag | 1 |  Cut mark shape is zigzagged.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace